# cnnvd score tool ref to http://www.cnnvd.org.cn/web/wz/bzxqById.tag?id=2&mkid=2
# code by kafroc


vec = ['攻击途径', '网络', '邻接', '本地', '物理']
choose = input('攻击途径\n1) 网络\n2) 邻接\n3) 本地\n4) 物理\n选择数字: ')
choose = int(choose)
if choose not in [1, 2, 3, 4]:
    exit(1)
vector = vec[choose]

comp = ['', '低', '高']
choose = input('\n\n攻击复杂度\n1) 低\n2) 高\n选择数字: ')
choose = int(choose)
if choose not in [1, 2, 3, 4]:
    exit(1)
complicate = comp[choose]

priv = ['', '无', '低', '高']
choose = input('\n\n权限要求\n1) 无\n2) 低\n3) 高\n选择数字: ')
choose = int(choose)
if choose not in [1, 2, 3]:
    exit(1)
privilege = priv[choose]

inte = ['', '不需要', '需要']
choose = input('\n\n用户交互\n1) 不需要\n2) 需要\n选择数字: ')
choose = int(choose)
if choose not in [1, 2]:
    exit(1)
interactive = inte[choose]

scop = ['范围', '不变', '改变']
choose = input('\n\n%s\n1) %s\n2) %s\n选择数字: ' % (scop[0], scop[1], scop[2]))
choose = int(choose)
if choose not in range(len(scop)) or choose == 0:
    exit(1)
scope = scop[choose]

exploitable = [["网络", "低", "无", "不需要", "3.89", "4.20"], ["网络", "低", "无", "需要", "2.84", "3.06"], ["网络", "低", "低", "不需要", "2.84", "3.36"], ["网络", "低", "低", "需要", "2.07", "2.45"], ["网络", "低", "高", "不需要", "1.23", "2.47"], ["网络", "低", "高", "需要", "0.90", "1.80"], ["网络", "高", "无", "不需要", "2.22", "2.40"], ["网络", "高", "无", "需要", "1.62", "1.75"], ["网络", "高", "低", "不需要", "1.62", "1.92"], ["网络", "高", "低", "需要", "1.18", "1.40"], ["网络", "高", "高", "不需要", "0.71", "1.41"], ["网络", "高", "高", "需要", "0.51", "1.03"], ["邻接", "低", "无", "不需要", "2.84", "3.06"], ["邻接", "低", "无", "需要", "2.07", "2.23"], ["邻接", "低", "低", "不需要", "2.07", "2.45"], ["邻接", "低", "低", "需要", "1.51", "1.79"], ["邻接", "低", "高", "不需要", "0.90", "1.80"], ["邻接", "低", "高", "需要", "0.66", "1.31"], ["邻接", "高", "无", "不需要", "1.62", "1.75"], ["邻接", "高", "无", "需要", "1.18", "1.28"], ["邻接", "高", "低", "不需要", "1.18", "1.40"], ["邻接", "高", "低", "需要", "0.86", "1.02"], ["邻接", "高", "高", "不需要", "0.51", "1.03"], ["邻接", "高", "高", "需要", "0.38", "0.75"], [
    "本地", "低", "无", "不需要", "2.52", "2.72"], ["本地", "低", "无", "需要", "1.83", "1.98"], ["本地", "低", "低", "不需要", "1.83", "2.17"], ["本地", "低", "低", "需要", "1.34", "1.59"], ["本地", "低", "高", "不需要", "0.80", "1.60"], ["本地", "低", "高", "需要", "0.58", "1.17"], ["本地", "高", "无", "不需要", "1.44", "1.55"], ["本地", "高", "无", "需要", "1.05", "1.13"], ["本地", "高", "低", "不需要", "1.05", "1.24"], ["本地", "高", "低", "需要", "0.76", "0.91"], ["本地", "高", "高", "不需要", "0.46", "0.91"], ["本地", "高", "高", "需要", "0.33", "0.67"], ["物理", "低", "无", "不需要", "0.91", "0.99"], ["物理", "低", "无", "需要", "0.67", "0.72"], ["物理", "低", "低", "不需要", "0.67", "0.79"], ["物理", "低", "低", "需要", "0.49", "0.58"], ["物理", "低", "高", "不需要", "0.29", "0.58"], ["物理", "低", "高", "需要", "0.21", "0.42"], ["物理", "高", "无", "不需要", "0.52", "0.56"], ["物理", "高", "无", "需要", "0.38", "0.41"], ["物理", "高", "低", "不需要", "0.38", "0.45"], ["物理", "高", "低", "需要", "0.28", "0.33"], ["物理", "高", "高", "不需要", "0.17", "0.33"], ["物理", "高", "高", "需要", "0.12", "0.24"]]
impatvec = [["高", "高", "高", "5.87", "6.53"], ["高", "高", "低", "5.45", "6.45"], ["高", "高", "无", "5.18", "6.22"], ["高", "低", "高", "5.45", "6.45"], ["高", "低", "低", "4.70", "5.69"], ["高", "低", "无", "4.22", "5.09"], ["高", "无", "高", "5.18", "6.22"], ["高", "无", "低", "4.22", "5.09"], ["高", "无", "无", "3.60", "4.31"], ["低", "高", "高", "5.45", "6.45"], ["低", "高", "低", "4.70", "5.69"], ["低", "高", "无", "4.22", "5.09"], ["低", "低", "高", "4.70", "5.69"], [
    "低", "低", "低", "3.37", "4.03"], ["低", "低", "无", "2.51", "2.94"], ["低", "无", "高", "4.22", "5.09"], ["低", "无", "低", "2.51", "2.94"], ["低", "无", "无", "1.41", "1.55"], ["无", "高", "高", "5.18", "6.22"], ["无", "高", "低", "4.22", "5.09"], ["无", "高", "无", "3.60", "4.31"], ["无", "低", "高", "4.22", "5.09"], ["无", "低", "低", "2.51", "2.94"], ["无", "低", "无", "1.41", "1.55"], ["无", "无", "高", "3.60", "4.31"], ["无", "无", "低", "1.41", "1.55"], ["无", "无", "无", "0.00", "0.00"]]

vec = ['机密性', '无', '低', '高']
choose = input('\n\n%s\n1) %s\n2) %s\n3) %s\n选择数字: ' %
               (vec[0], vec[1], vec[2], vec[3]))
choose = int(choose)
if choose not in range(len(vec)) or choose == 0:
    exit(1)
confidential = vec[choose]

vec = ['完整性', '无', '低', '高']
choose = input('\n\n%s\n1) %s\n2) %s\n3) %s\n选择数字: ' %
               (vec[0], vec[1], vec[2], vec[3]))
choose = int(choose)
if choose not in range(len(vec)) or choose == 0:
    exit(1)
integraty = vec[choose]

vec = ['可用性', '无', '低', '高']
choose = input('\n\n%s\n1) %s\n2) %s\n3) %s\n选择数字: ' %
               (vec[0], vec[1], vec[2], vec[3]))
choose = int(choose)
if choose not in range(len(vec)) or choose == 0:
    exit(1)
availability = vec[choose]

# calculate score 1
for i in exploitable:
    if vector == i[0] and complicate == i[1] and privilege == i[2] and interactive == i[3]:
        if scope == scop[1]:
            score1 = i[4]
        if scope == scop[2]:
            score1 = i[5]
        break

# calculare score 2
for i in impatvec:
    if confidential == i[0] and integraty == i[1] and availability == i[2]:
        if scope == scop[1]:
            score2 = i[3]
        if scope == scop[2]:
            score2 = i[4]
        break

score = float(score1) + float(score2)
riskvec = [[3.9, "低危"], [6.9, "中危"], [8.9, "高危"], [10, "严重"]]
for i in riskvec:
    if score <= i[0]:
        risk = i[1]
        break

print("********************************************************************************")
print("影响范围\t%s\n攻击途径\t%s\n攻击复杂度\t%s\n权限要求\t%s\n用户交互\t%s\n机密性影响\t%s\n完整性影响\t%s\n可用性影响\t%s\n漏洞评分 %.2f\t危害等级 %s" %
      (scope, vector, complicate, privilege, interactive, confidential, integraty, availability, score, risk))
